2.4.2.1日常数据加工与分发支撑

基于营服流批一体数据处理平台，对各线上触点采集的原始插码数据进行深度加工。依据业务具体需求，进行数据解析、清洗及格式转换，按需分发至一级APP、权益、互联网渠道及分省各应用系统，输出需求文档、技术方案、接口文档、测试文档等，支撑运营单位日常数据应用。

基于营服流批一体数据处理平台，对各线上触点采集的原始插码数据进行深度开发与优化，包括：分析实时业务具体需求，精准解析并清洗用户及渠道归属等信息，有效剔除冗余数据、精细化拆分接口等开发优化。按需分发至一级APP、权益、互联网渠道及分省各应用系统，输出需求文档、技术方案、接口文档、测试文档等，支撑运营单位日常数据应用。



支撑插码数据融通和数据共享，针对不同数据采集与上报格式，要求数据具备一致性、实时性，应答人提供满足数据一致性、实时性支撑方案与实施案例。
应答方应保障插码原始数据加工后的对外离线和实时接口推送的稳定性，及时性及准确性。



2.4.2.2插码数据场景化应用支撑

提升实时数据开发服务能力，推动各单位将营销场景插码数据支撑模式从离线升级为实时，赋能线上精细化运营策略。持续为热线坐席实时查询呼入用户互联网行为轨迹、IOP协同运营之“逐梦远洋”活动及终端店铺接力续航等实时营销场景提供数据支撑。新增针对支付宝/快手/抖音等互联网头部渠道实时营销战报，线上用户行为实时洞察等场景的数据支撑。

由离线向实时升级来支撑各单位插码营销场景需求，赋能线上精细化运营策略。持续为热线坐席实时查询呼入用户互联网行为轨迹、IOP协同运营之“逐梦远洋”活动及终端店铺接力续航等实时营销场景提供数据支撑。新增针对支付宝/快手/抖音等互联网头部渠道实时营销战报，线上用户行为实时洞察等场景的数据支撑。输出需求文档、技术方案、接口文档、测试文档等，支撑运营单位日常数据应用。

支撑客服服务场景化需求,


具体要求如下：
支撑客服服务场景化需求，基于系统平台中心营服数据平台流处理工具完成数据开发，应答人提供流处理开发平台开发方案与实施案例，开发方案包含但不限于梳理应用场景、编写插码方案、插码核查、可视化开发及测试等全套流程。实施案例包含但不限于案例介绍、开发截图等。营服数据平台流处理工具为中国移动自研的流程化、配置化开发工具。
支撑场景化营销需求，随着精准营销场景化支撑要求的提高，数据提供形式由传统的“数据清洗-按需推送”向“数据清洗-数据存储-数据查询”转变，并支持业务场景化配置，提供API查询接口供其他应用调用获取数据，应答人提供技术方案与实施案例，技术方案包含但不限于离线数据清洗方案、实时数据清洗方案、数据存储方案、API查询方案。
支撑数据稽核场景化需求，降低人工核查成本，提高稽核效率，开发并更新迭代自动化稽核平台，应答人提供自动化稽核开发方案与实施案例，方案包含但不限于原型图、UI设计文档、需求规格说明书、用户操作手册。实施案例包含但不限于基于稽核标准取值规范性、采集完整性、埋点合理性、数据合理性四大标准分别举例说明，同时提供平台功能截图及功能描述。持续迭代优化稽核工具更加智能化的满足业务方需求，减少人工参与。
包括但不限上述场景化需求支撑，开发相关工具。


原版：
基于统一采集的各线上触点插码原始数据，进行数据解析、清洗及格式转换，按需分发至一级APP、权益、互联网渠道及分省各应用系统，输出需求文档、技术方案、接口文档、测试文档等，支撑运营单位日常数据应用。
支撑插码数据融通和数据共享，针对不同数据采集与上报格式，要求数据具备一致性、实时性，应答人提供满足数据一致性、实时性支撑方案与实施案例。
应答方应保障插码原始数据加工后的对外离线和实时接口推送的稳定性，及时性及准确性。

修订：
基于营服流批一体数据处理平台，对各线上触点采集的原始插码数据进行深度开发与优化，包括：分析实时业务具体需求，精准解析并清洗用户及渠道归属等信息，有效剔除冗余数据、精细化拆分接口等开发优化。按需分发至一级APP、权益、互联网渠道及分省各应用系统，输出需求文档、技术方案、接口文档、测试文档等，支撑运营单位日常数据应用。




原版：
基于离线与实时数据开发服务，支撑各单位插码数据场景化需求。支撑热线坐席对呼入用户行为轨迹实时查询（客服服务）、互联网及APP触点卡套包场景化营销、终端店铺接力续航、数据稽核等场景化应用支撑，输出需求文档、技术方案、接口文档、测试文档等，支撑运营单位日常数据应用。
具体要求如下：
支撑客服服务场景化需求，基于系统平台中心营服数据平台流处理工具完成数据开发，应答人提供流处理开发平台开发方案与实施案例，开发方案包含但不限于梳理应用场景、编写插码方案、插码核查、可视化开发及测试等全套流程。实施案例包含但不限于案例介绍、开发截图等。营服数据平台流处理工具为中国移动自研的流程化、配置化开发工具。
支撑场景化营销需求，随着精准营销场景化支撑要求的提高，数据提供形式由传统的“数据清洗-按需推送”向“数据清洗-数据存储-数据查询”转变，并支持业务场景化配置，提供API查询接口供其他应用调用获取数据，应答人提供技术方案与实施案例，技术方案包含但不限于离线数据清洗方案、实时数据清洗方案、数据存储方案、API查询方案。
支撑数据稽核场景化需求，降低人工核查成本，提高稽核效率，开发并更新迭代自动化稽核平台，应答人提供自动化稽核开发方案与实施案例，方案包含但不限于原型图、UI设计文档、需求规格说明书、用户操作手册。实施案例包含但不限于基于稽核标准取值规范性、采集完整性、埋点合理性、数据合理性四大标准分别举例说明，同时提供平台功能截图及功能描述。持续迭代优化稽核工具更加智能化的满足业务方需求，减少人工参与。
包括但不限上述场景化需求支撑，开发相关工具。

修订：
由离线向实时升级来支撑各单位插码营销场景需求，赋能线上精细化运营策略。持续为热线坐席实时查询呼入用户互联网行为轨迹、IOP协同运营之“逐梦远洋”活动及终端店铺接力续航等实时营销场景提供数据支撑。新增针对支付宝/快手/抖音等互联网头部渠道实时营销战报，线上用户行为实时洞察等场景的数据支撑。输出需求文档、技术方案、接口文档、测试文档等，支撑运营单位日常数据应用。(新增)
